# 002 IaaS
20.04.2022
## Контекст
Компания имеет большой штат разработчиков, говорящих на различных языках, и охотно адаптирует новые технологии для экспериментальных приложений. 
## Решение
Требуется использовать провайдеров, предоставляющих IaaS (инфраструктура как услуга)
* Средства разработки
* Решения для виртуальных машин
* Системы для совместной работы с файлами в Интернете
* Системы резервного копирования и архивирования базы данных
* Анализ больших данных 
* Поисковые средства 
## Последствия
С помощью этих ресурсов разработка сможет содавать индивидуальные решения, объединяя различные облачные функции и уровни
